{"data":{"markdownRemark":{"html":"<p>We encourage everyone to help us maintaining the crypto-timeline. To be able to contribute content you need to have some basic <a href=\"https://guides.github.com/introduction/git-handbook/\">git-skills</a> and know how content can be written with <a href=\"https://guides.github.com/features/mastering-markdown/\">markdown</a>.</p>\n<p>This is really all you need to know. If these requirements are met you are ready to contribute by following these steps:</p>\n<ol>\n<li>fork our repository <a href=\"https://github.com/kryptokrauts/kk-website\">kk-website</a></li>\n<li>\n<p>look for existing <a href=\"https://github.com/kryptokrauts/kk-website/issues?q=is%3Aopen+is%3Aissue+label%3Atimeline+label%3Acontent\">timeline-issues</a></p>\n<ul>\n<li>alternatively create a new issue for the timeline-event you want to write about and label it with <code>content</code> and <code>timeline</code></li>\n</ul>\n</li>\n<li>create a new branch from the actual <code>origin/master</code></li>\n<li>create a markdown file in the timeline folder <code>src/data/timeline</code> and make sure its name begins with the date of the timeline event (e.g. <code>2010-05-22-pizzas-for-10000-btc.md</code>)</li>\n<li>\n<p>write the article</p>\n<ul>\n<li>see below in more detail how the file should be structured</li>\n</ul>\n</li>\n<li>commit your changes and provide the number of the github issue in the commit message</li>\n<li>\n<p>create a pull-request into the master of our repository</p>\n<ul>\n<li>we will review the contribution and might ask for some adjustments</li>\n<li>if the review is fine we will merge the pull-request and the article should show up after a short period of time</li>\n</ul>\n</li>\n</ol>\n<p><strong>Note:</strong>\nWe are using <a href=\"https://www.gatsbyjs.org/\">Gatsby</a> to build the kryptokrauts website. If you want to preview your changes locally you need to install it by running <code>npm install -g gatsby-cli</code>. Afterwards you will be able to run <code>gatsby develop</code> to serve the website on <a href=\"http://localhost:8000\">http://localhost:8000</a>.</p>\n<p><strong>How to structure the content of the markdown-file?</strong></p>\n<p>Please add a frontmatter to have some meta information attached to your new timeline entry. The frontmatter\nlooks like following:</p>\n<pre><code>---\npublishedOn: \"YYYY-MM-DD\"\ndate: \"YYYY-MM-DD\"\ntitle: \"Some title you can choose\"\npath: \"path/to/entry\"\nauthor: \"Some Guy\"\nicon: \"fontawesome icon name\"\nthumbnail: \"url to a cool image\"\nthumbnailSource: \"where you got the image from\"\n---\n</code></pre>\n<p>The date should contain the release date of the article. The title is the name which is displayed in the main section and the path is the URL to reach the article. The path should match the following pattern:</p>\n<ul>\n<li><code>timeline/[filename]</code>  </li>\n</ul>\n<p>The <code>path</code> is an optional parameter. If you do not specify a path you can create a timeline item without content. So the item is not clickable. We will only show the event as part of the timeline but not attach an article to it.</p>\n<p>The icon can be any fontawesome icon name and will be displayed in the timeline. The default icon is:</p>\n<ul>\n<li>\n<p><code>fas fa-bell</code></p>\n</li>\n</ul>\n<p>Optionally you can provide a thumbnail-image which will be rendered in the background of the timeline-event. Make sure to <strong><em>only use royalty free images</em></strong> and always provide the source where it comes from.</p>\n<p>All the other content can be added below and does support all standard markdown. Images can also be included in the content section. Again, don't forget to only use royalty free images and provide the respective source. Example:</p>\n<pre><code>&#x3C;div style=\"font-size:80%;\">\n    &#x3C;img src=\"https://images.pexels.com/photos/730567/pexels-photo-730567.jpeg?auto=compress&#x26;cs=tinysrgb&#x26;dpr=2&#x26;w=100\" >&#x3C;br />&#x3C;i>Image: Pexels&#x3C;/i>\n&#x3C;/div>\n</code></pre>\n<p>The example will be rendered as follows:</p>\n<div style=\"font-size:80%;\">\n    <img src=\"https://images.pexels.com/photos/730567/pexels-photo-730567.jpeg?auto=compress&cs=tinysrgb&dpr=2&w=100\" ><br /><i>Image: Pexels</i>\n</div>\n<p>Have fun creating content for our crypto-timeline. If you have any questions or run into problems you can always contact us via <a href=\"https://twitter.com/kryptokrauts\">Twitter</a>.</p>\n<p><strong>Thanks for you contribution!</strong></p>","frontmatter":{"publishedOn":"2019-03-31","date":null,"title":"How to contribute to the timeline","author":"Jan-Patrick Weller & Marco Walz"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}